# MEPNetworkSegmentId Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentId Class
Members See Also
---
Represents a unique identifier for one analytical segment in the network.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class MEPNetworkSegmentId : IDisposable
```

Visual Basic
---
```text
Public Class MEPNetworkSegmentId _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MEPNetworkSegmentId : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..MEPNetworkSegmentId
# See Also
MEPNetworkSegmentId Members
Autodesk.Revit.DB.Analysis Namespace